{
  "backend/main.mo": "Main Motoko actor implementing a cricket match scoring system with types for dismissals, batsmen, bowlers, innings, match results, and analytics; includes access control, user profiles, match history storage/retrieval, and analytics functions for top performers and team statistics.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of frontend components including App, contexts, hooks, and UI components for cricket match scoring with dark theme, match state management, scoring panels, statistics, history, and analytics views.",
  "frontend/index.html": "HTML entry point for the Cricket Match Scorer application with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component providing QueryClient, ThemeProvider (forced dark), MatchProvider context, and view routing between scoring, stats, history, analytics, scorecard, and match analytics views with header, footer, dialogs, and toaster.",
  "frontend/src/components/Analytics.tsx": "Analytics dashboard component with date filtering via calendar popover, displaying loading/error states and rendering bar/line charts using Recharts for match statistics when data is available.",
  "frontend/src/components/CurrentPlayers.tsx": "Component displaying current batsmen and bowler with stats, strike rates, and badges; includes dialogs for adding batsmen, changing bowlers, and retiring batsmen with replacement selection, plus swap strike functionality.",
  "frontend/src/components/DeploymentDiagnosticsDialog.tsx": "Dialog component displaying deployment diagnostics with tabs for overview, full error details, and suggestions; includes copy-to-clipboard functionality and uses deployment error parser utilities to format build/deploy failure information.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with a heart icon and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Main header component with navigation menu, view switching (scoring/stats/history/analytics), match controls (reset, new match, clear history), and deployment diagnostics integration.",
  "frontend/src/components/InningsTransitionDialog.tsx": "Modal dialog displayed between innings showing first innings summary, target score, and button to start second innings.",
  "frontend/src/components/MatchAnalyticsView.tsx": "Detailed analytics view for a completed match displaying charts for top batsmen, bowlers, score comparison, and run distribution using Recharts.",
  "frontend/src/components/MatchCompleteDialog.tsx": "Dialog shown when match completes, displaying match summary and automatically saving match data to backend with duplicate detection and error handling.",
  "frontend/src/components/MatchHistory.tsx": "Grid view of completed matches with cards showing team names, scores, dates, and buttons to view detailed scorecard or analytics.",
  "frontend/src/components/MatchScorecard.tsx": "Detailed scorecard view for a completed match with tabbed innings display showing batting and bowling statistics in tables.",
  "frontend/src/components/MatchStats.tsx": "Displays match statistics in tabbed tables showing batting (runs, balls, strike rate, fours, sixes) and bowling (overs, runs, wickets, economy) stats for all players, with badges indicating current striker, retired, and out status.",
  "frontend/src/components/NewMatchDialog.tsx": "Modal dialog for configuring and starting a new cricket match with inputs for team names, overs, match date, toss winner selection, and a virtual toss feature that randomly determines the toss winner.",
  "frontend/src/components/ScoreDisplay.tsx": "Displays the main scoreboard showing current runs/wickets, overs, run rate, and projected total for first innings or required run rate and runs needed for second innings.",
  "frontend/src/components/ScoringButtons.tsx": "Provides interactive buttons for scoring runs (0-6), recording extras (wide, no ball), and wickets, with validation to ensure batsmen and bowler are selected before scoring.",
  "frontend/src/components/ScoringPanel.tsx": "Main scoring interface that orchestrates ScoreDisplay, CurrentPlayers, and ScoringButtons components, showing a start screen when no match is active and handling innings transition and match completion dialogs.",
  "frontend/src/contexts/MatchContext.tsx": "React context providing comprehensive cricket match state management including runs, wickets, overs, players, bowlers, ball history, innings tracking, and methods for scoring, player management, and match flow control.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity login state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDeploymentDiagnostics.ts": "React hook that reads deployment/build failure context from localStorage and URL query params, parses errors, and provides methods to enable/disable debug mode and clear diagnostics.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for cricket match data operations including storing matches, fetching match history, retrieving analytics, clearing history, and filtering matches by date.",
  "frontend/src/index.css": "Tailwind CSS configuration with dark theme color variables using OKLCH color space for UI components including sidebar, charts, and semantic colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/deploymentErrorParser.ts": "Utility functions to parse and classify deployment/build error messages, extract relevant information, and provide actionable suggestions based on failure type (build vs deploy).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking known issues (duplicate match history entries, score recording problems), existing features, and pending feature requests including duplicate protection and auto-prompting for next batsman."
}