{
  "backend/main.mo": "Defines cricket match types, access control, user profile management, and match history storage with role‑restricted operations.",
  "feature_evidence.json": "Lists feature evidence for deployment retry diagnostics, including affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files and components for reference.",
  "frontend/index.html": "HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring views, routing, dialogs, theming, query client, and deployment diagnostics.",
  "frontend/src/components/Analytics.tsx": "Analytics dashboard that loads matches with optional date filtering and renders charts or fallback states.",
  "frontend/src/components/CurrentPlayers.tsx": "Displays current batsmen and bowler with dialogs for adding, changing, and retiring players, including strike and state logic.",
  "frontend/src/components/DeploymentDiagnosticsDialog.tsx": "Dialog showing deployment diagnostics with tabs for overview, full error, and suggestions, plus copy and clear actions.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with view switching, match controls, diagnostics access, and dialogs for resetting, new matches, and clearing history.",
  "frontend/src/components/InningsTransitionDialog.tsx": "Dialog shown between innings displaying first‑innings summary and target, with a button to start the second innings.",
  "frontend/src/components/MatchAnalyticsView.tsx": "View that loads match data and analytics, showing charts for batsmen, bowlers, and score comparisons with back navigation.",
  "frontend/src/components/MatchCompleteDialog.tsx": "Dialog saving completed match results, preventing duplicates, computing winner, and converting players to backend format.",
  "frontend/src/components/MatchHistory.tsx": "Lists saved matches with scores and dates, handling loading/errors and allowing navigation to scorecards or analytics.",
  "frontend/src/components/MatchScorecard.tsx": "Renders a detailed scorecard for a selected match with innings summaries, batting and bowling tables, and loading/error states.",
  "frontend/src/components/MatchStats.tsx": "Displays live match statistics including batting and bowling tables with strike rate and economy calculations.",
  "frontend/src/components/NewMatchDialog.tsx": "Provides a dialog to configure and start a new match with team info, overs, toss selection, and date.",
  "frontend/src/components/ScoreDisplay.tsx": "Shows the current match score, run rates, overs, projected totals, and target info for second innings.",
  "frontend/src/components/ScoringButtons.tsx": "Offers scoring controls for runs, extras, and wickets with validation and feedback to update match state.",
  "frontend/src/components/ScoringPanel.tsx": "Main scoring interface that shows score display, players, scoring buttons, and match dialogs, or a start screen if no match is active.",
  "frontend/src/contexts/MatchContext.tsx": "Defines the cricket match state context and provider with logic for updating runs, wickets, overs, innings transitions, and players/bowlers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useDeploymentDiagnostics.ts": "Reads, parses, and manages deployment error diagnostics from localStorage and URL parameters with debug mode controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading identities, handling login/logout, and exposing login status.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for storing matches, fetching histories/analytics, clearing data, and date-based filters.",
  "frontend/src/index.css": "Sets up Tailwind CSS and defines theme variables for dark mode and UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/utils/deploymentErrorParser.ts": "Parses deployment error strings, classifies them as build or deploy issues, and provides descriptions and suggestions.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current state, known issues, existing features, and pending feature requests for fixing duplicate match history entries."
}