{
  "kind": "build_request",
  "title": "Reset scoring state to fix recording issues",
  "projectName": "Cricket Scorer",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Add a \"Reset Current Match\" action in the frontend that clears all in-progress match state (scores, wickets, overs, players, bowlers, innings data) managed by `frontend/src/contexts/MatchContext.tsx`, returning the scorer to the initial \"no active match\" state without affecting saved match history in the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-reset-request"
        ],
        "quotes": [
          "problem with recording scores, can you reset it?"
        ]
      },
      "acceptanceCriteria": [
        "A reset action is available in the Header component or ScoringPanel that the user can trigger",
        "Triggering the reset clears all match state fields (current score, wickets, overs, batsmen, bowler, innings) in MatchContext",
        "After reset, the ScoringPanel displays the start screen prompting the user to begin a new match",
        "The reset does NOT delete any saved matches from backend history",
        "User receives confirmation that the current match has been reset"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Ensure that resetting the current match does not trigger any backend mutations or affect stored match history, and verify that the user can immediately start a new match after reset without encountering state conflicts or validation errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-reset-request"
        ]
      },
      "acceptanceCriteria": [
        "Reset operation only modifies local React state in MatchContext",
        "No backend actor calls (storeMatch, clearAllMatches, etc.) are invoked during reset",
        "After reset, opening the New Match dialog and starting a match works as expected",
        "Scoring buttons and player management function correctly in the newly started match"
      ]
    }
  ],
  "constraints": [
    "Do not modify backend/main.mo or any backend logic",
    "Do not alter saved match history or clearAllMatches functionality",
    "Preserve existing Internet Identity authentication flow",
    "Do not change immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui"
  ],
  "nonGoals": [
    "Implementing a selective \"undo last ball\" feature",
    "Adding match state persistence across browser sessions",
    "Creating backup or restore functionality for in-progress matches",
    "Modifying the backend schema or match storage logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}